InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ИзменениеКонтактнойИнформацииЗалогодателя/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеВыбораАдресаПоПрописке(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    АдресПоПропискеСтруктура = Результат.Значение;
	АдресПоПрописке = Результат.Представление;
	
	Если ФактическийСовпадает Тогда
		ФактическийАдрес = АдресПоПрописке;
	    ФактическийАдресСтруктура = АдресПоПропискеСтруктура;
	КонецЕсли;	
	Если ПочтовыйСовпадает Тогда
		ПочтовыйАдрес = АдресПоПрописке;
	    ПочтовыйАдресСтруктура = АдресПоПропискеСтруктура;
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Функция ПолучитьВКИ(Инд = 0)
	Если Инд = 0 Тогда
	   Возврат Справочники.ВидыКонтактнойИнформации.АдресПоПрописке;
	ИначеЕсли Инд = 1 Тогда
	   Возврат Справочники.ВидыКонтактнойИнформации.АдресФактический;
    ИначеЕсли Инд = 2 Тогда
	   Возврат Справочники.ВидыКонтактнойИнформации.АдресПочтовый;
    КонецЕсли;
КонецФункции	

&НаСервере
Функция ПолучитьВКИТелефон()
	Возврат Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораФактическогоАдреса(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
    ФактическийАдресСтруктура = Результат.Значение;
	ФактическийАдрес = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПочтовогоАдреса(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
    ПочтовыйАдресСтруктура = Результат.Значение;
	ПочтовыйАдрес = Результат.Представление;

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораТелефона(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
    ТелефонСтруктура = Результат.Значение;
	Телефон = Результат.Представление;

КонецПроцедуры


&НаКлиенте
Процедура АдресПоПропискеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ());
	ПараметрыФормы.Вставить("Значение", АдресПоПропискеСтруктура);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораАдресаПоПрописке",ЭтаФорма);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ(1));
	ПараметрыФормы.Вставить("Значение", ФактическийАдресСтруктура);
	ПараметрыФормы.Вставить("Представление", ФактическийАдрес);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФактическогоАдреса",ЭтаФорма);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ПочтовыйАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИ(2));
	ПараметрыФормы.Вставить("Значение", ПочтовыйАдресСтруктура);
	ПараметрыФормы.Вставить("Представление", ПочтовыйАдрес);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПочтовогоАдреса",ЭтаФорма);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПолучитьВКИТелефон());
	ПараметрыФормы.Вставить("Значение", ТелефонСтруктура);
	ПараметрыФормы.Вставить("Представление", Телефон);
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", истина);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТелефона",ЭтаФорма);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Владелец") Тогда
	    Залогодатель           = Параметры.Владелец;
		Период = Параметры.Дата;
		ЗаполнитьИнформациюОКонтакте();
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Гражданство) Тогда
		Гражданство = Справочники.СтраныМира.Россия;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Если ФактическийСовпадает Тогда
		Элементы.ФактическийАдрес.ТолькоПросмотр = Истина;
	Иначе	
		Элементы.ФактическийАдрес.ТолькоПросмотр = ложь;
	КонецЕсли;	
	
	Если ПочтовыйСовпадает Тогда
		Элементы.ПочтовыйАдрес.ТолькоПросмотр = Истина;
	Иначе	
		Элементы.ПочтовыйАдрес.ТолькоПросмотр = ложь;
	КонецЕсли;	

КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Период) Тогда
	    Период = ТекущаяДата();
	КонецЕсли;
	Если АдресПоПрописке = ФактическийАдрес Тогда
		ФактическийСовпадает = Истина;
	Иначе	
		ФактическийСовпадает = Ложь;
	КонецЕсли;	
	
	Если АдресПоПрописке = ПочтовыйАдрес Тогда
		ПочтовыйСовпадает = Истина;
	Иначе	
		ПочтовыйСовпадает = Ложь;
	КонецЕсли;	

	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйСовпадаетПриИзменении(Элемент)
	ПочтовыйАдрес = АдресПоПрописке;
	ПочтовыйАдресСтруктура = АдресПоПропискеСтруктура;
	УстановитьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура ФактическийСовпадаетПриИзменении(Элемент)
	ФактическийАдрес = АдресПоПрописке;
	ФактическийАдресСтруктура = АдресПоПропискеСтруктура;
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОКонтакте()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Период", Период);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ТелефонСтруктура КАК ТелефонСтруктура,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПропискеСтруктура КАК АдресПоПропискеСтруктура,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдресСтруктура КАК ФактическийАдресСтруктура,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ПочтовыйАдресСтруктура КАК ПочтовыйАдресСтруктура,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияСтрана КАК МестоРожденияСтрана,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияОбласть КАК МестоРожденияОбласть,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияРайон КАК МестоРожденияРайон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРожденияНаселенныйПункт КАК МестоРожденияНаселенныйПункт
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Период, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаРождения = Выборка.ДатаРождения;
		МестоРождения = Выборка.МестоРождения;
		МестоРожденияСтрана = Выборка.МестоРожденияСтрана;
		МестоРожденияОбласть = Выборка.МестоРожденияОбласть;
		МестоРожденияРайон = Выборка.МестоРожденияРайон;
		МестоРожденияНаселенныйПункт = Выборка.МестоРожденияНаселенныйПункт;
		Пол = Выборка.Пол;
		Гражданство = Выборка.Гражданство;
		Email = Выборка.Email;
		Телефон = Выборка.Телефон;
		АдресПоПрописке = Выборка.АдресПоПрописке;
		АдресПоПропискеСтруктура = Выборка.АдресПоПропискеСтруктура;
		ФактическийАдрес = Выборка.ФактическийАдрес;
		ФактическийАдресСтруктура = Выборка.ФактическийАдресСтруктура;
        ПочтовыйАдрес = Выборка.ПочтовыйАдрес;
		ПочтовыйАдресСтруктура = Выборка.ПочтовыйАдресСтруктура;
    КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьКонтакт()
	// изменим запись рег. сведений
	НаборЗаписей = РегистрыСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Залогодатель.Установить(Залогодатель);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НоваяЗапись = НаборЗаписей[0];
	КонецЕсли;
	НоваяЗапись.Период = Период;
	НоваяЗапись.Залогодатель = Залогодатель;
	НоваяЗапись.ДатаРождения = ДатаРождения;
	НоваяЗапись.МестоРождения = МестоРождения;
	НоваяЗапись.МестоРожденияСтрана = МестоРожденияСтрана;
	НоваяЗапись.МестоРожденияОбласть = МестоРожденияОбласть;
	НоваяЗапись.МестоРожденияРайон = МестоРожденияРайон;
	НоваяЗапись.МестоРожденияНаселенныйПункт = МестоРожденияНаселенныйПункт;
	НоваяЗапись.Гражданство = Гражданство;
	НоваяЗапись.Телефон = Телефон;
	НоваяЗапись.ТелефонСтруктура = ТелефонСтруктура;
	НоваяЗапись.Пол = Пол;
	НоваяЗапись.Email = Email;
	НоваяЗапись.АдресПоПрописке = АдресПоПрописке;
	НоваяЗапись.АдресПоПропискеСтруктура = АдресПоПропискеСтруктура;
	НоваяЗапись.ФактическийАдрес = ФактическийАдрес;
	НоваяЗапись.ФактическийАдрес = ФактическийАдресСтруктура;
	НоваяЗапись.ПочтовыйАдрес = ПочтовыйАдрес;
	НоваяЗапись.ПочтовыйАдрес = ПочтовыйАдресСтруктура;
	НаборЗаписей.Записать();	
КонецПроцедуры

&НаСервере
Функция ПроверитьПередЗаписью()
	Если НЕ ПустаяСтрока(АдресПоПропискеСтруктура) Тогда
		//Савранин 27.04.2023 -->
		//СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.СтрокаJSONВСтруктуру(АдресПоПропискеСтруктура);
		СтруктураАдреса = АдресныйКлассификаторСлужебный.КонтактнаяИнформацияВСтруктуруJSON(АдресПоПропискеСтруктура);
		//<-- Савранин 27.04.2023		
	КонецЕсли;	
	Возврат Истина;
КонецФункции	

&НаКлиенте
Процедура Записать(Команда)
	Если ПроверитьЗаполнение() И ПроверитьПередЗаписью() Тогда
		ЗаписатьКонтакт();
		Закрыть(Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьВозрастЗалогодателя()
	Возврат ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
КонецФункции	

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ЕстьОш = ложь;
	Если ДатаРождения > Период Тогда
	    Сообщить("Дата рождения клиента позже текущей даты! Проверьте правильность ввода даты рождения.", СтатусСообщения.Информация);
		ЕстьОш = истина;
	ИначеЕсли ДатаРождения <= Дата(1922, 01, 01) Тогда
		Сообщить("Клиенту 120 лет?! Проверьте правильность ввода даты рождения.", СтатусСообщения.Информация);
		ЕстьОш = истина;
	КонецЕсли;	
	ВозрастЗалогодателя = ПолучитьВозрастЗалогодателя();
	Если ВозрастЗалогодателя < 18 Тогда
	    Сообщить("Клиенту " + Строка(ВозрастЗалогодателя) + " лет. Выдача займов и прием оплаты по договору займа от лиц, не достигших 18 лет, не осуществляется!", СтатусСообщения.Важное);
		ЕстьОш = истина;
	КонецЕсли;	
    Если ЕстьОш Тогда
	    ДатаРождения = Дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМестаРождения(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	МестоРожденияСтрана = Результат.МестоРожденияСтрана;
	МестоРожденияОбласть = Результат.МестоРожденияОбласть;
    МестоРожденияРайон = Результат.МестоРожденияРайон;
    МестоРожденияНаселенныйПункт = Результат.МестоРожденияНаселенныйПункт;
	МестоРождения = Результат.МестоРождения;

КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораМестаРождения",ЭтаФорма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МестоРожденияСтрана", МестоРожденияСтрана);
	ПараметрыФормы.Вставить("МестоРожденияОбласть", МестоРожденияОбласть);
	ПараметрыФормы.Вставить("МестоРожденияРайон", МестоРожденияРайон);
	ПараметрыФормы.Вставить("МестоРожденияНаселенныйПункт", МестоРожденияНаселенныйПункт);
	ПараметрыФормы.Вставить("МестоРождения", МестоРождения);
	ОткрытьФорму("Обработка.ЛБ_ПомощникВводаМестаРождения.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
